import 'package:flutter/material.dart';

class MyText {
  static const splash1 =
      "هل تسوية الصفوف في صلاة الجماعة واجبة ، بمعنى  أن المصلين يأثمون إذا لم يسووا الصفوف ؟.";
  static const splash2 =
      "هل تسوية الصفوف في صلاة الجماعة واجبة ، بمعنى  أن المصلين يأثمون إذا لم يسووا الصفوف ؟.";
  static const splash3 =
      "هل تسوية الصفوف في صلاة الجماعة واجبة ، بمعنى  أن المصلين يأثمون إذا لم يسووا الصفوف ؟.";
  static const splash4 =
      "هل تسوية الصفوف في صلاة الجماعة واجبة ، بمعنى  أن المصلين يأثمون إذا لم يسووا الصفوف ؟.";
  static const splash_button1 = "تسجيل الدخول";
  static const splash_button2 = "دخول كــزائـر";
  static const TextFormField_login_user = "اسم المستخدم   ";
  static const TextFormField_login_password = "كلمة المرور";
  static const TextFormField_sign_in_user = "ادخل الاسم";
  static const TextFormField_sign_in_phon = "ادخل رقم الهاتف";
  static const TextFormField_sign_in_email = "ادخل البريد الاكتروني";
  static const TextFormField_sign_in_password = "أنشئ كلمة مرور";
  static const TextFormField_sign_in_Re_password = "اعد كتابة كلمة المرور ";
  static const Text_login_forget_password = "هل نسيت كلمة المرور؟";
  static const Text_login_goto_signin_page1 = "ليس لديك حساب؟";
  static const Text_sign_in = "اشتراك";
  static const Text_forgat_pass_remamper = "تذكر كلمة المرور ؟";
  static const Text_forgat_pass_back_to_login = "العودة إلى تسجيل الدخول";
  static const link_of_wasal = "www.wasal.com";
  static const dec_forget_pass_page =
      "الرجاء إدخال البريد الإلكتروني الخاص بك ونحن نكمل الخاص بك لك رابط للعودة إلى حسابك";
  static const text_forgat_pass_button = "أكمل";
  static const text_verifi_diloag_ =
      " قم بتسجيل الدخول باستخدام بريدك الإلكتروني وكلمة المرور أو تواصل مع وسائل التواصل الاجتماعي";
  static const text_sigin_student = "تسجيل الطالب";
  static const text_Academy_departments = " اقسام الاكاديمية";
  static const text_Cadre_of_Jats = " كادر جاتس";
  static const text_soppp = " العروض والمفاجأت";
  static const searsh_about = "...بحث عن ";
  static const textAll = " الكل";
  static const text_GATS_Academy_staff = "كادر أكاديمية جاتس";
  static const textDepartmentEnglash = " قسم اللغة الانجليزية";
  static const textDepartmentAccounting = " قسم  المحاسبة والانظمة المحاسبية";
  static const textDepartmentGraphics = " قسم  الجرافيكس والموناج";
  static const textDepartmentSecondaryReinforcement = " قسم  التقوية الثانوية";
  static const textDepartmentScientificCourses = " قسم  الدورات العلمية";
  static const textDepartmentComputer = " قسم  الحاسوب";
  static const textNameOfCourse = " المصور 2022 ماستركلاس";

  static const textTimeOfCourse = "مدة الدورة";
  static const textAboutCourse4 = "  هذه الدورة التدريبية ستفيدك إذا كنت:";
  static const textAboutCourse5 = """اهمية ذلك بالنسبة الى الادارة 
تطبيق نظام محاسبة التكاليف في المشاريع الزراعية
الطرق التقليدية رغما عن النتائج التي تحققها الطريقة التقليدية في المستفيدين كما في مشروع
حساب تكلفة الانشطة المختلفة و حساب المستفيدين كما في المستفيدين كما في مشروع الرنك الزراعي . وقد هدف البحث
""";

  static const textAboutCourse = "عن الدورة";
  static const textAboutCourse3 =
      """ *اهمية ذلك بالنسبة الى الادارة ، وتمثلت مشكلة البحث في غياب المستفيدين كما في مشروع الرنك الزراعي . وقد هدف البحث
تطبيق نظام محاسبة التكاليف في المشاريع الزراعية واعتمادها على المستفيدين كما في مشروع الرنك الزراعي . وقد هدف البحث
الطرق التقليدية رغما عن النتائج التي تحققها الطريقة التقليدية في المستفيدين كما في مشروع الرنك الزراعي . وقد هدف البحث
حساب تكلفة الانشطة المختلفة و حساب المستفيدين كما في المستفيدين كما في مشروع الرنك الزراعي . وقد هدف البحث
""";
  static const textAboutCourse2 = """ تحتوي هذة الدورة على 4 أجزاء 
ستتعرف من خلالها على :  """;

  static const textAboutCourse1 =
      """  اهمية ذلك بالنسبة الى الادارة ، وتمثلت مشكلة البحث في غياب 
تطبيق نظام محاسبة التكاليف في المشاريع الزراعية واعتمادها على
 الطرق التقليدية رغما عن النتائج التي تحققها الطريقة التقليدية في
 حساب تكلفة الانشطة المختلفة و حساب المستفيدين كما في 
مشروع الرنك الزراعي .وقد هدف البحث
اهمية ذلك بالنسبة الى 
الادارة ، وتمثلت مشكلة البحث في غياب تطبيق نظام محاسبة 
التكاليف في المشاريع الزراعية واعتمادهاعلى الطرق التقليدية رغما
 عن النتائج التي تحققها الطريقة التقليدية في حساب تكلفة 
الانشطة المختلفة و حساب المستفيدين كما في مشروع الرنك
 الزراعي .وقد هدف البحث
اهمية ذلك بالنسبة الى الادارة 
 وتمثلت مشكلة البحث في غياب تطبيق نظام محاسبة التكاليف 
المشاريع الزراعية واعتمادها على الطرق التقليدية رغما عن النتائج 
التي تحققها الطريقة التقليدية في حساب تكلفة الانشطة المختلفة
 و حساب المستفيدين كما في مشروع الرنك الزراعي .وقد هدف 
البحث
اهمية ذلك بالنسبة الى الادارة 
وتمثلت مشكلة البحث في غياب تطبيق نظام محاسبة التكاليف في المشاريع الزراعية 
واعتمادها على الطرق التقليدية رغما عن النتائج التي تحققها 
الطريقة التقليدية في حساب تكلفة الانشطة المختلفة و حساب 
المستفيدين كما في مشروع الرنك الزراعي . وقد هدف البحث""";
  static const textAboutCourse11 =
      """  اهمية ذلك بالنسبة الى الادارة ، وتمثلت مشكلة البحث في غياب 
تطبيق نظام محاسبة التكاليف في المشاريع الزراعية واعتمادها على
 الطرق التقليدية رغما عن النتائج التي تحققها الطريقة التقليدية في
 حساب تكلفة الانشطة المختلفة و حساب المستفيدين كما في 
مشروع الرنك الزراعي .وقد هدف البحث
البحث
اهمية ذلك بالنسبة الى الادارة 
وتمثلت مشكلة البحث في غياب تطبيق نظام محاسبة التكاليف في المشاريع الزراعية 
واعتمادها على الطرق التقليدية رغما عن النتائج التي تحققها 
الطريقة التقليدية في حساب تكلفة الانشطة المختلفة و حساب 
المستفيدين كما في مشروع الرنك الزراعي . وقد هدف البحث""";

  static const textAboutUs =
      """تضح في مقدمة كتاب ابن الجوزي صيد الخاطر إنما كتب هذه الفصول ليسجّل
 فيها خواطره التي أثارتها تجاربه وعلاقاته مع الأشياء. وهذه الخواطر ليست وليدة 
البحث والدرس العميق وإنما هي خواطر آنية تولد وتزول سريعاً إنْ لم تُدوّن
 لهذا سعى إلى تدوينها في هذا الكتاب وسمّاه (صيد الخاطر) كما سمّى فيما بعد
 أحمد أمين أشهر كتاب في المقالة الأدبية في الأدب العربي الحديث (فيض الخاطر)
 وهذا يعني أنَّ مفهوم ابن الجوزي لفصول كتابه قريب من مفهوم مونتاني
 لفصوله فهو جسّد فيها خواطره معلّقاً على هذا القول أو ذاك ومصوراً تجارب 
نفسه وعيوبها وما توصل إليه من أفكار تتعلق بالدين والحياة والمجتمع.
تضح في مقدمة كتاب ابن الجوزي صيد الخاطر إنما كتب هذه الفصول ليسجّل
 فيها خواطره التي أثارتها تجاربه وعلاقاته مع الأشياء. وهذه الخواطر ليست وليدة 
البحث والدرس العميق وإنما هي خواطر آنية تولد وتزول سريعاً إنْ لم تُدوّن
 لهذا سعى إلى تدوينها في هذا الكتاب وسمّاه (صيد الخاطر) كما سمّى فيما بعد
تضح في مقدمة كتاب ابن الجوزي صيد الخاطر إنما كتب هذه الفصول ليسجّل
 فيها خواطره التي أثارتها تجاربه وعلاقاته مع الأشياء. وهذه الخواطر ليست وليدة 
البحث والدرس العميق وإنما هي خواطر آنية تولد وتزول سريعاً إنْ لم تُدوّن
 لهذا سعى إلى تدوينها في هذا الكتاب وسمّاه (صيد الخاطر) كما سمّى فيما بعد لفصوله فهو جسّد فيها خواطره معلّقاً على هذا القول أو ذاك ومصوراً تجارب 
نفسه وعيوبها وما توصل إليه من أفكار تتعلق بالدين والحياة والمجتمع.
تضح في مقدمة كتاب ابن الجوزي صيد الخاطر إنما كتب هذه الفصول ليسجّل
 فيها خواطره التي أثارتها تجاربه وعلاقاته مع الأشياء. وهذه الخواطر ليست وليدة 
البحث والدرس العميق وإنما هي خواطر آنية تولد وتزول سريعاً إنْ لم تُدوّن
 لهذا سعى إلى تدوينها في هذا الكتاب وسمّاه (صيد الخاطر) كما سمّى فيما بعد
 أحمد أمين أشهر كتاب في المقالة الأدبية في الأدب العربي الحديث (فيض الخاطر)
 وهذا يعني أنَّ مفهوم ابن الجوزي لفصول كتابه قريب من مفهوم مونتاني
 لفصوله فهو جسّد فيها خواطره معلّقاً على هذا القول أو ذاك ومصوراً تجارب 
نفسه وعيوبها وما توصل إليه من أفكار تتعلق بالدين والحياة والمجتمع.""";
}
